Revit 2026 API

# InsertOrientation Enumeration

---

The allowed values for the INSERT_ORIENTATION parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum InsertOrientation
```
```vb
Public Enumeration InsertOrientation
```
```cpp
public enum class InsertOrientation
```
```fsharp
type InsertOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Exterior | 2 | Insert is aligned with the Tapered wall's exterior face. |
| Interior | 3 | Insert is aligned with the Tapered wall's interior face. |
| Slanted | 1 | Insert is aligned with the Slanted wall's slant direction. |
| Vertical | 0 | Insert is vertical regardless of the wall's slant. |

#### Reference

Autodesk.Revit.DB Namespace